/*此题存在争议*/
/*题目中要求了n1和n2的输入范围，我们小组加了n1 n2 范围的判断，反复提交均为错误*/
/*后来尝试着不加n1 n2 范围的判断，提交一次就正确了*/
/*说明测试软件没限制范围（比如我输入0 10，我们的运行结果为输入错误，读入下一组数据；而所谓“正确”的结果直接输出了10，这里就与题干要求不符了）*/
/*结束 下面为ProblemB代码*/

/////////加了限制的ProblemB////////////////////////
/////////运行结果no -wrong answer//////////////////
/*
#include<iostream.h>
int main(){
	int n1=0;
	int n2=0;
	while(true){
		cin>>n1>>n2;
		if(n1==0&&n2==0)
			break;
		if(!(n1>=1&&n1<=100)||!(n2>=1&&n2<=100))
			continue;
              cout<<n2-n1<<endl;
	}
	return 0;
}
*/


////////////////没加限制的ProblemB///////////////////
///////////////////运行结果反而yes///////////////////////
/*
#include<iostream.h>
int main(){
	int n1=0;
	int n2=0;
	while(true){
		cin>>n1>>n2;
		if(n1==0&&n2==0)
			break;
        cout<<n2-n1<<endl;
	}
	return 0;
}
*/
